Revit 2024 API
GradientBackgroundSettings.HorizonColor Property
 The color of the horizon.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public Color HorizonColor { get; set; }
Visual Basic
Public Property HorizonColor As Color
	Get
	Set
Visual C++
public:
property Color^ HorizonColor {
	Color^ get ();
	void set (Color^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
GradientBackgroundSettings Class
Autodesk.Revit.DB Namespace